{
    "0": 52,
    "1": 53,
    "2": 54,
    "3": 55,
    "4": 56,
    "5": 57,
    "6": 58,
    "7": 59,
    "8": 60,
    "9": 61,
    "10": 446,
    "11": 607,
    "12": 696,
    "13": 457,
    "14": 437,
    "15": 440,
    "16": 467,
    "17": 430,
    "18": 502,
    "19": 439,
    "20": 438,
    "21": 418,
    "22": 612,
    "23": 447,
    "24": 442,
    "25": 426,
    "26": 431,
    "27": 428,
    "28": 443,
    "29": 419,
    "30": 621,
    "31": 703,
    "32": 717,
    "33": 604,
    "34": 631,
    "35": 626,
    "36": 658,
    "37": 683,
    "38": 672,
    "39": 702,
    "40": 646,
    "41": 862,
    "42": 903,
    "43": 915,
    "44": 701,
    "45": 596,
    "46": 706,
    "47": 911,
    "48": 697,
    "49": 866,
    "50": 655,
    "51": 958,
    "52": 896,
    "53": 1018,
    "54": 678,
    "55": 628,
    "56": 709,
    "57": 918,
    "58": 711,
    "59": 902,
    "60": 623,
    "61": 848,
    "62": 893,
    "63": 951,
    "64": 617,
    "65": 603,
    "66": 606,
    "67": 917,
    "68": 634,
    "69": 905,
    "70": 586,
    "71": 713,
    "72": 707,
    "73": 616,
    "74": 585,
    "75": 605,
    "76": 704,
    "77": 629,
    "78": 636,
    "79": 705,
    "80": 610,
    "81": 912,
    "82": 959,
    "83": 952,
    "84": 611,
    "85": 598,
    "86": 708,
    "87": 892,
    "88": 659,
    "89": 914,
    "90": 592,
    "91": 682,
    "92": 668,
    "93": 593,
    "94": 589,
    "95": 601,
    "96": 645,
    "97": 625,
    "98": 622,
    "99": 710,
    "100": 886,
    "101": 850,
    "102": 775,
    "103": 732,
    "104": 816,
    "105": 898,
    "106": 854,
    "107": 722,
    "108": 720,
    "110": 754,
    "111": 864,
    "112": 801,
    "113": 838,
    "114": 793,
    "115": 784,
    "116": 776,
    "117": 764,
    "118": 807,
    "119": 859,
    "120": 825,
    "121": 876,
    "122": 785,
    "123": 863,
    "124": 904,
    "125": 758,
    "126": 799,
    "127": 735,
    "128": 746,
    "129": 715,
    "130": 894,
    "131": 794,
    "132": 845,
    "133": 789,
    "134": 882,
    "135": 741,
    "136": 888,
    "137": 763,
    "138": 743,
    "139": 860,
    "140": 881,
    "141": 797,
    "142": 787,
    "143": 830,
    "144": 826,
    "145": 843,
    "146": 716,
    "147": 878,
    "148": 890,
    "149": 778,
    "150": 874,
    "151": 810,
    "152": 817,
    "153": 753,
    "154": 782,
    "155": 821,
    "156": 773,
    "157": 757,
    "158": 809,
    "159": 900,
    "160": 790,
    "161": 839,
    "162": 842,
    "163": 887,
    "164": 767,
    "165": 812,
    "166": 869,
    "167": 981,
    "168": 857,
    "169": 734,
    "170": 803,
    "171": 895,
    "172": 766,
    "173": 727,
    "174": 745,
    "175": 808,
    "176": 779,
    "177": 834,
    "178": 815,
    "179": 828,
    "180": 956,
    "181": 756,
    "182": 835,
    "183": 780,
    "184": 929,
    "185": 938,
    "186": 726,
    "187": 884,
    "188": 871,
    "189": 788,
    "190": 769,
    "191": 923,
    "192": 768,
    "193": 889,
    "194": 738,
    "195": 714,
    "196": 798,
    "197": 819,
    "198": 749,
    "199": 870,
    "200": 806,
    "201": 853,
    "202": 920,
    "203": 877,
    "204": 765,
    "205": 858,
    "206": 836,
    "207": 759,
    "208": 802,
    "209": 786,
    "210": 718,
    "211": 755,
    "212": 719,
    "213": 721,
    "214": 841,
    "215": 945,
    "216": 792,
    "217": 731,
    "218": 791,
    "219": 772,
    "220": 832,
    "221": 724,
    "222": 733,
    "223": 747,
    "224": 907,
    "225": 771,
    "226": 761,
    "227": 796,
    "228": 737,
    "229": 875,
    "230": 824,
    "231": 865,
    "232": 770,
    "233": 833,
    "234": 868,
    "235": 879,
    "236": 813,
    "237": 861,
    "238": 901,
    "239": 913,
    "240": 744,
    "241": 919,
    "242": 873,
    "243": 820,
    "244": 748,
    "245": 867,
    "246": 872,
    "247": 723,
    "248": 823,
    "249": 899,
    "250": 811,
    "251": 800,
    "252": 847,
    "253": 739,
    "254": 783,
    "255": 814,
    "256": 908,
    "257": 855,
    "258": 725,
    "259": 883,
    "260": 736,
    "261": 846,
    "262": 751,
    "263": 885,
    "264": 897,
    "265": 837,
    "266": 910,
    "267": 777,
    "268": 840,
    "269": 750,
    "270": 931,
    "271": 774,
    "272": 730,
    "273": 880,
    "274": 712,
    "275": 851,
    "276": 781,
    "277": 909,
    "278": 852,
    "279": 849,
    "280": 856,
    "281": 943,
    "282": 762,
    "283": 891,
    "284": 926,
    "285": 795,
    "286": 805,
    "287": 740,
    "289": 818,
    "290": 729,
    "291": 804,
    "292": 829,
    "293": 822,
    "294": 760,
    "295": 728,
    "296": 752,
    "297": 844,
    "298": 742,
    "299": 831,
    "300": 827,
    "334": 955,
    "341": 993,
    "358": 1005,
    "367": 1017,
    "397": 933,
    "399": 1011,
    "402": 982,
    "410": 1004,
    "427": 983,
    "431": 988,
    "434": 1009,
    "452": 953,
    "454": 995,
    "456": 1020,
    "457": 963,
    "459": 921,
    "472": 994,
    "484": 1019,
    "492": 996,
    "500": 979,
    "508": 954,
    "512": 1016,
    "531": 1002,
    "545": 960,
    "570": 977,
    "573": 984,
    "590": 992,
    "592": 927,
    "602": 1003,
    "625": 944,
    "636": 998,
    "657": 1001,
    "661": 985,
    "662": 941,
    "667": 1008,
    "669": 967,
    "675": 928,
    "688": 1000,
    "691": 948,
    "693": 968,
    "694": 989,
    "703": 957,
    "705": 974,
    "707": 916,
    "712": 970,
    "714": 1014,
    "717": 969,
    "733": 991,
    "741": 978,
    "742": 906,
    "743": 930,
    "747": 935,
    "754": 1010,
    "764": 1022,
    "775": 966,
    "784": 976,
    "801": 971,
    "811": 924,
    "814": 1023,
    "818": 947,
    "820": 975,
    "826": 986,
    "828": 939,
    "831": 1006,
    "833": 961,
    "841": 980,
    "850": 922,
    "870": 972,
    "874": 950,
    "880": 934,
    "881": 987,
    "890": 942,
    "894": 1012,
    "895": 973,
    "903": 940,
    "921": 936,
    "923": 999,
    "936": 990,
    "937": 946,
    "938": 949,
    "941": 962,
    "951": 997,
    "957": 964,
    "960": 1015,
    "963": 1007,
    "964": 965,
    "966": 1013,
    "972": 937,
    "991": 932,
    "994": 1021,
    "998": 925,
    "<pad>": 0,
    "<unk>": 1,
    "<bos>": 2,
    "<eos>": 3,
    "\\u0000": 4,
    "\\u0001": 5,
    "\\u0002": 6,
    "\\u0003": 7,
    "\\u0004": 8,
    "\\u0005": 9,
    "\\u0006": 10,
    "\\u0007": 11,
    "\b": 12,
    "\t": 13,
    "\n": 14,
    "\\u000b": 15,
    "\f": 16,
    "\r": 17,
    "\\u000e": 18,
    "\\u000f": 19,
    "\\u0010": 20,
    "\\u0011": 21,
    "\\u0012": 22,
    "\\u0013": 23,
    "\\u0014": 24,
    "\\u0015": 25,
    "\\u0016": 26,
    "\\u0017": 27,
    "\\u0018": 28,
    "\\u0019": 29,
    "\\u001a": 30,
    "\\u001b": 31,
    "\\u001c": 32,
    "\\u001d": 33,
    "\\u001e": 34,
    "\\u001f": 35,
    " ": 36,
    "!": 37,
    "\"": 38,
    "#": 39,
    "$": 40,
    "%": 41,
    "&": 42,
    "'": 43,
    "(": 44,
    ")": 45,
    "*": 46,
    "+": 47,
    ",": 48,
    "-": 49,
    ".": 50,
    "/": 51,
    ":": 62,
    ";": 63,
    "<": 64,
    "=": 65,
    ">": 66,
    "?": 67,
    "@": 68,
    "A": 69,
    "B": 70,
    "C": 71,
    "D": 72,
    "E": 73,
    "F": 74,
    "G": 75,
    "H": 76,
    "I": 77,
    "J": 78,
    "K": 79,
    "L": 80,
    "M": 81,
    "N": 82,
    "O": 83,
    "P": 84,
    "Q": 85,
    "R": 86,
    "S": 87,
    "T": 88,
    "U": 89,
    "V": 90,
    "W": 91,
    "X": 92,
    "Y": 93,
    "Z": 94,
    "[": 95,
    "\\": 96,
    "]": 97,
    "^": 98,
    "_": 99,
    "`": 100,
    "a": 101,
    "b": 102,
    "c": 103,
    "d": 104,
    "e": 105,
    "f": 106,
    "g": 107,
    "h": 108,
    "i": 109,
    "j": 110,
    "k": 111,
    "l": 112,
    "m": 113,
    "n": 114,
    "o": 115,
    "p": 116,
    "q": 117,
    "r": 118,
    "s": 119,
    "t": 120,
    "u": 121,
    "v": 122,
    "w": 123,
    "x": 124,
    "y": 125,
    "z": 126,
    "{": 127,
    "|": 128,
    "}": 129,
    "~": 130,
    "": 131,
    "": 132,
    "": 133,
    "": 134,
    "": 135,
    "": 136,
    "": 137,
    "": 138,
    "": 139,
    "": 140,
    "": 141,
    "": 142,
    "": 143,
    "": 144,
    "": 145,
    "": 146,
    "": 147,
    "": 148,
    "": 149,
    "": 150,
    "": 151,
    "": 152,
    "": 153,
    "": 154,
    "": 155,
    "": 156,
    "": 157,
    "": 158,
    "": 159,
    "": 160,
    "": 161,
    "": 162,
    "": 163,
    " ": 164,
    "¡": 165,
    "¢": 166,
    "£": 167,
    "¤": 168,
    "¥": 169,
    "¦": 170,
    "§": 171,
    "¨": 172,
    "©": 173,
    "ª": 174,
    "«": 175,
    "¬": 176,
    "­": 177,
    "®": 178,
    "¯": 179,
    "°": 180,
    "±": 181,
    "²": 182,
    "³": 183,
    "´": 184,
    "µ": 185,
    "¶": 186,
    "·": 187,
    "¸": 188,
    "¹": 189,
    "º": 190,
    "»": 191,
    "¼": 192,
    "½": 193,
    "¾": 194,
    "¿": 195,
    "À": 196,
    "Á": 197,
    "Â": 198,
    "Ã": 199,
    "Ä": 200,
    "Å": 201,
    "Æ": 202,
    "Ç": 203,
    "È": 204,
    "É": 205,
    "Ê": 206,
    "Ë": 207,
    "Ì": 208,
    "Í": 209,
    "Î": 210,
    "Ï": 211,
    "Ð": 212,
    "Ñ": 213,
    "Ò": 214,
    "Ó": 215,
    "Ô": 216,
    "Õ": 217,
    "Ö": 218,
    "×": 219,
    "Ø": 220,
    "Ù": 221,
    "Ú": 222,
    "Û": 223,
    "Ü": 224,
    "Ý": 225,
    "Þ": 226,
    "ß": 227,
    "à": 228,
    "á": 229,
    "â": 230,
    "ã": 231,
    "ä": 232,
    "å": 233,
    "æ": 234,
    "ç": 235,
    "è": 236,
    "é": 237,
    "ê": 238,
    "ë": 239,
    "ì": 240,
    "í": 241,
    "î": 242,
    "ï": 243,
    "ð": 244,
    "ñ": 245,
    "ò": 246,
    "ó": 247,
    "ô": 248,
    "õ": 249,
    "ö": 250,
    "÷": 251,
    "ø": 252,
    "ù": 253,
    "ú": 254,
    "û": 255,
    "ü": 256,
    "ý": 257,
    "þ": 258,
    "ÿ": 259,
    " S": 260,
    "DA": 261,
    " -": 262,
    " d": 263,
    " A": 264,
    " P": 265,
    "ra": 266,
    " R": 267,
    "EN": 268,
    "ENT": 269,
    "ENTR": 270,
    "ENTRA": 271,
    "ENTRADA": 272,
    " |": 273,
    " SA": 274,
    " SAI": 275,
    " SAIDA": 276,
    "nt": 277,
    "or": 278,
    "al": 279,
    "as": 280,
    "es": 281,
    "me": 282,
    " n": 283,
    "ro": 284,
    "da": 285,
    "ia": 286,
    " C": 287,
    "ame": 288,
    " Al": 289,
    "ci": 290,
    "os": 291,
    "de": 292,
    "au": 293,
    "lo": 294,
    " N": 295,
    " de": 296,
    "an": 297,
    "ar": 298,
    "sa": 299,
    "ira": 300,
    " T": 301,
    "ri": 302,
    "ves": 303,
    "ort": 304,
    "ve": 305,
    "do": 306,
    " Sal": 307,
    " F": 308,
    "asa": 309,
    "ão": 310,
    " J": 311,
    "ja": 312,
    " L": 313,
    "ameda": 314,
    " da": 315,
    " das": 316,
    " B": 317,
    " Se": 318,
    "raves": 319,
    "ravessa": 320,
    " c": 321,
    " nº": 322,
    " V": 323,
    " M": 324,
    "dov": 325,
    "dovia": 326,
    " Ro": 327,
    " s": 328,
    " Re": 329,
    " Pau": 330,
    "dor": 331,
    "ua": 332,
    "par": 333,
    "part": 334,
    "partame": 335,
    "partament": 336,
    "partamento": 337,
    "ib": 338,
    " Alameda": 339,
    "ont": 340,
    "ven": 341,
    "veni": 342,
    "venida": 343,
    "/P": 344,
    " Pra": 345,
    " Travessa": 346,
    " São": 347,
    " Casa": 348,
    " Rodovia": 349,
    "/R": 350,
    " Rua": 351,
    "te": 352,
    " Sala": 353,
    " a": 354,
    "sc": 355,
    "sco": 356,
    "ca": 357,
    " Avenida": 358,
    " do": 359,
    " D": 360,
    " Apartamento": 361,
    " Lo": 362,
    " Loja": 363,
    "re": 364,
    "ári": 365,
    " Praç": 366,
    " Praça": 367,
    "li": 368,
    "ale": 369,
    "mb": 370,
    "mbro": 371,
    " Sete": 372,
    "ntes": 373,
    "cif": 374,
    "cife": 375,
    "nia": 376,
    "anau": 377,
    "anaus": 378,
    " G": 379,
    "orto": 380,
    "gre": 381,
    "ortale": 382,
    "ortalez": 383,
    "ortaleza": 384,
    " Paulo": 385,
    " Be": 386,
    " Belo": 387,
    " H": 388,
    "va": 389,
    "vador": 390,
    " Recife": 391,
    "ane": 392,
    "anei": 393,
    "aneiro": 394,
    " Go": 395,
    " Ri": 396,
    " Rio": 397,
    "uri": 398,
    "urit": 399,
    "uritib": 400,
    "uritiba": 401,
    " Manaus": 402,
    " Porto": 403,
    " Ale": 404,
    " Alegre": 405,
    " Fortaleza": 406,
    " Hor": 407,
    " Hori": 408,
    " Horiz": 409,
    " Horizont": 410,
    " Horizonte": 411,
    " Salvador": 412,
    " Goi": 413,
    " Goiâ": 414,
    " Goiânia": 415,
    " Nº": 416,
    "/PE": 417,
    " sal": 420,
    " Janeiro": 421,
    " Sa": 422,
    " nu": 423,
    " nume": 424,
    " numero": 425,
    "oa": 427,
    " Curitiba": 429,
    "/C": 432,
    "/CE": 433,
    "/RS": 434,
    " cs": 435,
    " casa": 436,
    " sl": 441,
    "/M": 444,
    "/MG": 445,
    " Sant": 448,
    " Santos": 449,
    " Du": 450,
    " Dum": 451,
    " Dumont": 452,
    "/B": 453,
    "/BA": 454,
    "/A": 455,
    "/AM": 456,
    "/G": 458,
    "/GO": 459,
    " Vi": 460,
    " Visco": 461,
    " Viscon": 462,
    " Visconde": 463,
    " Pira": 464,
    " Piraj": 465,
    " Pirajá": 466,
    " lo": 468,
    " loja": 469,
    " Ros": 470,
    " Rosári": 471,
    " Rosário": 472,
    " Ac": 473,
    " Acá": 474,
    " Acáci": 475,
    " Acácias": 476,
    "/RJ": 477,
    " Lib": 478,
    " Libe": 479,
    " Liber": 480,
    " Liberda": 481,
    " Liberdade": 482,
    " sala": 483,
    "/S": 484,
    "/SP": 485,
    " Rep": 486,
    " Repú": 487,
    " Repúb": 488,
    " Repúbli": 489,
    " República": 490,
    " ap": 491,
    " Fra": 492,
    " Fran": 493,
    " Franci": 494,
    " Francisco": 495,
    " Co": 496,
    " Com": 497,
    " Comé": 498,
    " Comér": 499,
    " Comérci": 500,
    " Comércio": 501,
    " Tira": 503,
    " Tirade": 504,
    " Tiradentes": 505,
    "to": 506,
    "/PR": 507,
    " l": 508,
    " lj": 509,
    " Mar": 510,
    " Mare": 511,
    " Marec": 512,
    " Marech": 513,
    " Marechal": 514,
    " De": 515,
    " Deo": 516,
    " Deodor": 517,
    " Deodoro": 518,
    " Pal": 519,
    " Palme": 520,
    " Palmeira": 521,
    " Palmeiras": 522,
    " Jo": 523,
    " João": 524,
    " Pes": 525,
    " Pess": 526,
    " Pessoa": 527,
    " X": 528,
    " XV": 529,
    " No": 530,
    " Nove": 531,
    " Novembro": 532,
    " Jor": 533,
    " Jorg": 534,
    " Jorge": 535,
    " Am": 536,
    " Ama": 537,
    " Amado": 538,
    " Setembro": 539,
    " Fl": 540,
    " Flor": 541,
    " Flores": 542,
    " Pauli": 543,
    " Paulis": 544,
    " Paulist": 545,
    " Paulista": 546,
    " Vo": 547,
    " Vol": 548,
    " Volu": 549,
    " Volunt": 550,
    " Voluntári": 551,
    " Voluntários": 552,
    " Pá": 553,
    " Pát": 554,
    " Pátr": 555,
    " Pátria": 556,
    " Nos": 557,
    " Nossa": 558,
    " Sen": 559,
    " Senh": 560,
    " Senho": 561,
    " Senhora": 562,
    " t": 563,
    " Cas": 564,
    " Cast": 565,
    " Castro": 566,
    " Alves": 567,
    " ro": 568,
    " dos": 569,
    " Ban": 570,
    " Bande": 571,
    " Bandeira": 572,
    " Bandeirantes": 573,
    " p": 574,
    " r": 575,
    " Pr": 576,
    " Pres": 577,
    " Presi": 578,
    " Preside": 579,
    " President": 580,
    " Presidente": 581,
    " Var": 582,
    " Varg": 583,
    " Vargas": 584,
    " al": 587,
    " alameda": 588,
    " f": 590,
    " apartamento": 591,
    "iania": 594,
    " apto": 595,
    "ba": 597,
    " Ap": 599,
    " Apto": 600,
    " travessa": 602,
    " Tv": 608,
    " rod": 609,
    " rodovia": 613,
    " tv": 614,
    " Rod": 615,
    " m": 618,
    " manaus": 619,
    " rua": 620,
    " Pca": 624,
    " Pç": 627,
    " Praca": 630,
    " RU": 632,
    " RUA": 633,
    " Av": 635,
    " CE": 637,
    " BH": 638,
    " avenida": 639,
    " pra": 640,
    " praca": 641,
    " Ave": 642,
    " MA": 643,
    " MAO": 644,
    " porto": 647,
    " ale": 648,
    " alegre": 649,
    " g": 650,
    " go": 651,
    " goiania": 652,
    " re": 653,
    " recife": 654,
    " RE": 656,
    " REC": 657,
    " ri": 660,
    " rio": 661,
    " j": 662,
    " janeiro": 663,
    " AV": 664,
    " AVE": 665,
    " SS": 666,
    " SSA": 667,
    " fortaleza": 669,
    " PO": 670,
    " POA": 671,
    " fort": 673,
    " poa": 674,
    " GY": 675,
    " GYN": 676,
    " curitiba": 677,
    " RJ": 679,
    " cw": 680,
    " cwb": 681,
    " salvador": 684,
    "/ba": 685,
    " ssa": 686,
    " Hte": 687,
    " Ct": 688,
    " Ctba": 689,
    " av": 690,
    " b": 691,
    " bh": 692,
    ".P": 693,
    ".Pau": 694,
    ".Paulo": 695,
    " Sao": 698,
    " Goiania": 699,
    " SP": 700
}